package com.ch6;

public class SungJuk_InitData {

	public String[][] initData() {//지역변수 - 선언
	      //파라미터에 선언된 변수는 지역변수이고, 배열이므로 원본(38번줄)의 주소번지를 갖는다
	      System.out.println("initData메소드 호출 성공");
	      //2차 배열 선언해 봐요
	      String[][] datas = {
	                      	  {"1","이순신","80","75","85","","",""}         
	                      	 ,{"2","김유신","90","85","80","","",""}
	                      	 ,{"3","강감찬","70","75","70","","",""}
	                      	 ,{"4","뿡뿡형","40","65","30","","",""}
	                      	 ,{"5","엄친아","95","95","95","","",""}
	                     	 };
	      return datas;//리턴타입이 있어야 다른 메소드에서 그 값을 재사용 할 수 있다.
	}
	
}
