<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<%
/****************************************************************************** 
 < 계층형 게시판 화면설계 > + Table설계
 1. 필요한 페이지 선정하기 (페이지이름 정의)
 2. 계층형 게시판 화면 흐름도 작성하기 ( PPT 작성 : 순서도 )
 3. 프로젝트에 배치하기 ( xxx.jsp )
 4. 페이지 구성시 easyUI 적용해보기
 
 - easyUI는 스크립트기반의 UI솔루션이다. (엄밀히 따지면 자바스크립트임)
 - 자바스크립트는 객체이다. (ex. document : 브라우저 안의 내장객체)
 
 - easyUI에도 내장객체가 있다. (위치 : jquery.easyui.min.js)
 - 개발자가 디자인을 위해 코드에서 시간을 소모하는 것은 옳지 못한 시간관리임. 그래서 디자이너로부터 CSS를 받아서 적용함
 
 - import가 필요하다. ( jQuery 표현식을 따르기 때문 )
 ******************************************************************************/
%>
